app/views/photos/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."photo_id" = ?  [["photo_id", 4]]
---
      <h2>Comments</h2>
      <% @photo.comments.each do |comment| %>