app/controllers/comments_controller.rb

  def create
    @photo = Photo.find(params[:photo_id])
    @comment = Comment.create(comment_params.merge(photo_id: @photo.id, user_id: current_user.id))
---
SELECT  "photos".* FROM "photos" WHERE "photos"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
INSERT INTO "comments" ("body", "user_id", "photo_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "i know how to meet ladies"], ["user_id", 1], ["photo_id", 4], ["created_at", 2017-04-24 14:09:40 UTC], ["updated_at", 2017-04-24 14:09:40 UTC]]

  def destroy
    @photo = Photo.find(params[:photo_id])
    @comment = @photo.comments.find(params[:id])
    @comment.destroy
---
SELECT  "photos".* FROM "photos" WHERE "photos"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."photo_id" = ? AND "comments"."id" = ? LIMIT ?  [["photo_id", 4], ["id", 2], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 2]]