app/controllers/photos_controller.rb

  def index
    @photos = Photo.all.order(created_at: :desc)
---
SELECT "photos".* FROM "photos" ORDER BY "photos"."created_at" DESC

  def show
    @photo = Photo.find(params[:id])
---
SELECT  "photos".* FROM "photos" WHERE "photos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def edit
    @photo = Photo.find(params[:id])
---
SELECT  "photos".* FROM "photos" WHERE "photos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @photo = current_user.photos.build(photo_params)
    @photo.save
---
INSERT INTO "photos" ("caption", "created_at", "updated_at", "image_file_name", "image_content_type", "image_file_size", "image_updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @photo = Photo.find(params[:id])
    @photo.update(photo_params)
---
SELECT  "photos".* FROM "photos" WHERE "photos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "photos" SET "caption" = ?, "updated_at" = ? WHERE "photos"."id" = ?  [["caption", "should be working now eh"], ["updated_at", 2017-04-24 11:00:34 UTC], ["id", 1]]

  def destroy
    @photo = Photo.find (params[:id])
    @photo.destroy
---
SELECT  "photos".* FROM "photos" WHERE "photos"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "photos" WHERE "photos"."id" = ?  [["id", 2]]